In [18]:
import pandas as pd
import numpy as np

df = pd.read_csv('data.csv', sep=';', encoding='cp1251')
df.replace(r'^\s*$', np.nan, regex=True, inplace=True)
df.dropna(axis=0, how='any', inplace=True)
print(*df.shape)

2999 12

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 12 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Пол                                           2999 non-null   object
 1   Возраст                                       2999 non-null   object
 2   Путешествует с детьми                         2999 non-null   object
 3   Расстояние                                    2999 non-null   int64
 4   Включён завтрак                               2999 non-null   int64
 5   Наличие wifi                                  2999 non-null   int64
 6   Оценка удобства добирания до места            2999 non-null   int64
 7   Оценка интерсности досуга                     2999 non-null   object
 8   Оценка качества питания                       2999 non-null   object
 9   Оценка качества wifi                          2999 non-null   object
 10  Оценка комфортности палатки                   2999 non-null   object
 11  Общая оценка качества предоставленной услуги  2999 non-null   object
dtypes: int64(4), object(8)
memory usage: 281.3+ KB

In [7]:
df.describe()

,Расстояние,Включён завтрак,Наличие wifi,Оценка удобства добирания до места
count,2999.000000,2999.000000,2999.000000,2999.000000
mean,836.372457,0.612204,0.525175,3.261754
std,627.743694,0.487329,0.499449,0.952425
min,68.000000,0.000000,0.000000,1.000000
25%,400.000000,0.000000,0.000000,3.000000
50%,663.000000,1.000000,1.000000,3.000000
75%,1060.000000,1.000000,1.000000,4.000000
max,4539.000000,1.000000,1.000000,5.000000